

export const graduatePrograms = {
    construction_management_meng: {
        major: "ภาควิชาวิศวกรรมโยธา",
        title: "สาขาวิชาวิศวกรรมและการบริหารการก่อสร้าง",
        degree: "ปริญญาโท",
        title_en: "Master of Engineering Program in Construction Engineering and Management",
        contact: "053 944157",
        img: "/images/ce-logo.png",
        plans: [
            {
                plan_code: "1",
                plan_name: "แผน 1 แบบวิชาการ",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "ปริญญานิพนธ์ 36 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: [
                    "ภาคการศึกษาละ 25,000 บาท",
                    "ค่าธรรมเนียมตลอดหลักสูตร 100,000 บาท"
                ],
                qualification: [
                    "สำเร็จการศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิต หรือสาขาที่เกี่ยวข้องที่มีพื้นฐานทางวิศวกรรมศาสตร์ที่ดี",
                    "ได้รับเกียรตินิยม หรือมีประสบการณ์ในการทำงานวิชาชีพสาขาวิศวกรรมโยธามาแล้วไม่น้อยกว่า 2 ปี"
                ]
            },
             {
                plan_code: "2",
                plan_name: "แผน 2 แบบวิชาการ",
                study_type: "ภาคพิเศษ (ส.-อา.)",
                credit: "เรียนคอร์สเวิร์ก 24 หน่วยกิต ปริญญานิพนธ์ 12 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: [
                    "ภาคการศึกษาละ 25,000 บาท",
                    "ค่าธรรมเนียมตลอดหลักสูตร 100,000 บาท"
                ],
                qualification: [
                    "สำเร็จการศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิต หรือสาขาที่เกี่ยวข้องที่มีพื้นฐานทางวิศวกรรมศาสตร์ที่ดี"
                ]
            },
            {
                plan_code: "3",
                plan_name: "แผน 3 แบบวิชาชีพ",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "เรียนคอร์สเวิร์ก 30 หน่วยกิต การค้นคว้าอิสระ 6 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "เสาร์–อาทิตย์",
                fee: [
                    "ภาคการศึกษาละ 55,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 220,000 บาท"
                ],
                qualification: [
                    "สำเร็จการศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิต หรือสาขาวิชาอื่นที่เกี่ยวข้องกับงานก่อสร้าง",
                    "มีประสบการณ์ในการทำงานที่เกี่ยวข้องในด้านงานก่อสร้างมาแล้วไม่น้อยกว่า 2 ปี"
                ]
            },
           
        ]
    },

    civil_engineering_meng: {
        major: "ภาควิชาวิศวกรรมโยธา",
        title: "สาขาวิชาวิศวกรรมโยธา",
        title_en: "Master of Engineering Program in Civil Engineering",
        degree: "ปริญญาโท",
        contact: "053 944157",
        img: "/images/ce-logo.png",
        plans: [
            {
                plan_code: "1",
                plan_name: "แผน 1 แบบวิชาการ",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "ปริญญานิพนธ์ 36 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: [
                    "ภาคการศึกษาละ 25,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 100,000 บาท"
                ],
                qualification: [
                    "จบปริญญาตรีวิศวกรรมศาสตร์สาขาวิศวกรรมโยธาหรือสาขาใกล้เคียง จากสถาบันอุดมศึกษาที่ได้มาตรฐาน",
                    "มีผลการเรียนดีหรือมีประสบการณ์ด้านวิจัย/วิเคราะห์ไม่น้อยกว่า 2 ปี"
                ]
            },
            {
                plan_code: "2",
                plan_name: "แผน 2 แบบวิชาการ",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "เรียนคอร์สเวิร์ก 24 หน่วยกิต ปริญญานิพนธ์ 12 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: [
                    "ภาคการศึกษาละ 25,000 บาท",
                    "ค่าธรรมเนียมตลอดหลักสูตร 100,000 บาท"
                ],
                qualification: [
                    "สำเร็จการศึกษาระดับปริญญาตรีวิศวกรรมศาสตร์ในสาขาวิชาที่เกี่ยวข้อง หรือเทียบเท่า จากสถาบันอุดมศึกษาที่ได้รับการรับรองมาตรฐานจากสำนักงานคณะกรรมการการอุดมศึกษาหรือสำนักงานคณะกรรมการข้าราชการพลเรือน"
                ]
            }
        ]
    },

    civil_engineering_phd: {
        major: "ภาควิชาวิศวกรรมโยธา",
        title: "สาขาวิชาวิศวกรรมโยธา",
        title_en: "Doctor of Philosophy Program in Civil Engineering",
        degree: "ปริญญาเอก",
        contact: "053 944157",
        img: "/images/ce-logo.png",
        plans: [
            {
                plan_code: "1.1",
                plan_name: "แผน 1.1",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "ปริญญานิพนธ์ 48 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 3 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: [
                    "ภาคการศึกษาละ 50,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 300,000 บาท"
                ],
                qualification: [
                    "จบปริญญาโทสาขาวิศวกรรมโยธาหรือสาขาที่เกี่ยวข้อง GPA ไม่น้อยกว่า 3.25 หรือมีผลงานวิจัย/ประสบการณ์ด้านวิชาชีพเพียงพอ ผ่านเกณฑ์ภาษาอังกฤษของมหาวิทยาลัยเชียงใหม่"
                ]
            }
        ]
    },

    data_science_meng: {
        major: "ศูนย์การศึกษาสหวิทยาการสาขา",
        title: "สาขาวิชาวิทยาการข้อมูล",
        title_en: "Master of Science Program in Data Science",
        degree: "ปริญญาโท",
        contact: "053 944108",
        img: "/",
        plans: [
            {
                plan_code: "1",
                plan_name: "แผน 1 แบบวิชาการ",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "ปริญญานิพนธ์ 36 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: [
                    "ภาคการศึกษาละ 25,000 บาท",
                    "ค่าธรรมเนียมตลอดหลักสูตร 100,000 บาท"
                ],
                qualification: [
                    "สำเร็จการศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิต วิทยาศาสตรบัณฑิต หรือสาขาที่เกี่ยวข้องที่มีพื้นฐานทางคณิตศาสตร์ดี",
                    "ได้รับเกียรตินิยม หรือมีประสบการณ์ในการทำงานวิชาชีพสาขาวิทยาการข้อมูลมาแล้วไม่น้อยกว่า 2 ปี"
                ]
            },
            {
                plan_code: "2",
                plan_name: "แผน 2 แบบวิชาการ",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "เรียนคอร์สเวิร์ก 24 หน่วยกิต ปริญญานิพนธ์ 12 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: [
                    "คนไทย: ภาคการศึกษาละ 25,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 100,000 บาท",
                    "ต่างชาติ: ภาคการศึกษาละ 35,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 140,000 บาท"
                ],
                qualification: [
                    "สำเร็จการศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิต วิทยาศาสตรบัณฑิต หรือสาขาที่เกี่ยวข้องที่มีพื้นฐานทางคณิตศาสตร์ดี",
                    "หรือมีประสบการณ์ในการทำงานวิชาชีพสาขาวิทยาการข้อมูลมาแล้วไม่น้อยกว่า 1 ปี"
                ]
            },
            {
                plan_code: "3",
                plan_name: "แผน 3 แบบวิชาชีพ",
                study_type: "ภาคพิเศษ (ส.-อา.)",
                credit: "เรียนคอร์สเวิร์ก 24 หน่วยกิต ปริญญานิพนธ์ 12 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "เสาร์–อาทิตย์",
                fee: [
                    "ไทย: ภาคการศึกษาละ 40,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 160,000 บาท",
                    "ต่างชาติ: ภาคการศึกษาละ 50,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 200,000 บาท"
                ],
                qualification: [
                    "สำเร็จการศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิต วิทยาศาสตรบัณฑิต หรือสาขาที่เกี่ยวข้องที่มีพื้นฐานทางคณิตศาสตร์ดี",
                    "หรือมีประสบการณ์ในการทำงานวิชาชีพสาขาวิทยาการข้อมูลมาแล้วไม่น้อยกว่า 1 ปี"
                ]
            }
        ]
    },

    data_science_phd: {
        major: "ศูนย์การศึกษาสหวิทยาการสาขา",
        title: "สาขาวิชาวิทยาการข้อมูล",
        title_en: "Doctor of Philosophy Program in Data Science",
        degree: "ปริญญาเอก",
        contact: "053 944108",
        img: "/",
        plans: [
            {
                plan_code: "1.1",
                plan_name: "แผน 1.1",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "ปริญญานิพนธ์ 48 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 3 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: [
                    "ภาคการศึกษาละ 40,000 บาท",
                    "ค่าธรรมเนียมตลอดหลักสูตร 240,000 บาท"
                ],
                qualification: [
                    "สำเร็จการศึกษาระดับปริญญาโทในสาขาวิชาที่เกี่ยวข้อง โดยมีเกรดเฉลี่ยไม่น้อยกว่า 3.25 หรือเทียบเท่า และมีพื้นความรู้ความสามารถและศักยภาพเพียงพอที่จะทำวิทยานิพนธ์ได้",
                    "ในกรณีที่มีเกรดเฉลี่ยน้อยกว่า 3.25 จะต้องเป็นผู้มีประสบการณ์ในวิทยาการข้อมูลมาแล้วไม่น้อยกว่า 2 ปี หรือมีผลงานวิจัย ผลงานวิชาการ หรือผลงานอื่นในสาขาวิชาวิทยาการข้อมูลหรือการประยุกต์ใช้วิทยาการข้อมูลในศาสตร์ที่เกี่ยวข้องหรือเทียบเท่า",
                    "ผ่านความเห็นชอบจากคณะกรรมการบริหารหลักสูตร",
                    "มีผลการทดสอบภาษาอังกฤษ ตามประกาศมหาวิทยาลัยเชียงใหม่ เรื่อง เงื่อนไขภาษาต่างประเทศสำหรับนักศึกษาบัณฑิตศึกษา"
                ]
            }
        ]
    },

    geo_resource_engineering_meng: {
        major: "ภาควิชาวิศวกรรมเหมืองแร่และปิโตรเลียม",
        title: "สาขาวิชาวิศวกรรมทรัพยากรธรณีเพื่อความยั่งยืน",
        title_en: "Master of Engineering Program in Mining and Georesources Engineering",
        degree: "ปริญญาโท (หลักสูตรนานาชาติ)",
        contact: "053 944128",
        img: "/images/mn-logo.png",
        plans: [
            {
                plan_code: "1",
                plan_name: "แผน 1 แบบวิชาการ",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "ปริญญานิพนธ์ 36 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: [
                    "สำหรับนักศึกษาไทย กัมพูชา ลาว เมียนมาร์ และเวียดนาม: ภาคการศึกษาละ 30,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 120,000 บาท",
                    "สำหรับนักศึกษาต่างชาติอื่น ๆ: ภาคการศึกษาละ 50,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 200,000 บาท"
                ],
                qualification: [
                    "สำเร็จปริญญาตรีวิศวกรรมศาสตร์ หรือปริญญาตรีวิทยาศาสตร์ และได้รับอนุมัติจากคณะกรรมการหลักสูตร",
                    "สามารถเรียนเป็นภาษาอังกฤษได้ตลอดหลักสูตร"
                ]
            },
            {
                plan_code: "2",
                plan_name: "แผน 2 แบบวิชาการ",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "เรียนคอร์สเวิร์ก 18 หน่วยกิต ปริญญานิพนธ์ 18 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "สำหรับนักศึกษาไทย กัมพูชา ลาว เมียนมาร์ และเวียดนาม: ภาคการศึกษาละ 30,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 120,000 บาท | สำหรับนักศึกษาต่างชาติอื่น ๆ: ภาคการศึกษาละ 50,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 200,000 บาท",
                qualification: "เงื่อนไขเดียวกับแผน 1 คือจบปริญญาตรีวิศวกรรมศาสตร์ หรือวิทยาศาสตร์ที่คณะกรรมการหลักสูตรเห็นชอบ และสามารถใช้ภาษาอังกฤษในการเรียนได้"
            }
        ]
    },

    electrical_engineering_meng: {
        major: "ภาควิชาวิศวกรรมไฟฟ้า",
        title: "สาขาวิชาวิศวกรรมไฟฟ้า",
        title_en: "Master of Engineering Program in Electrical Engineering",
        degree: "ปริญญาโท",
        contact: "053 944157",
        img: "/images/ee-logo.png",
        plans: [
            {
                plan_code: "1",
                plan_name: "แผน 1 แบบวิชาการ",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "ปริญญานิพนธ์ 36 หน่วยกิต (เรียนคอร์สเวิร์ก 24 หน่วยกิต ปริญญานิพนธ์ 12 หน่วยกิต)",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 35,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 140,000 บาท",
                qualification: "จบปริญญาตรีสาขาวิศวกรรมไฟฟ้าหรือสาขาที่เกี่ยวข้อง GPA ไม่ต่ำกว่า 3.00 จากระบบ 4.00 หรือ GPA ไม่ต่ำกว่า 2.50 และมีประสบการณ์ทำงาน/วิจัยด้านวิศวกรรมไฟฟ้าอย่างน้อย 2 ปี"
            },
            {
                plan_code: "2",
                plan_name: "แผน 2 แบบวิชาการ",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "เรียนคอร์สเวิร์ก 24 หน่วยกิต ปริญญานิพนธ์ 12 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 40,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 160,000 บาท",
                qualification: "จบปริญญาตรีสาขาวิศวกรรมไฟฟ้าหรือสาขาที่เกี่ยวข้อง GPA ไม่ต่ำกว่า 3.00 หรือ GPA ไม่ต่ำกว่า 2.50 และมีประสบการณ์ทำงาน/วิจัยด้านวิศวกรรมไฟฟ้าอย่างน้อย 1 ปี"
            }
        ]
    },
    // วิศวกรรมไฟฟ้า (ปริญญาเอก)
    electrical_engineering_phd: {
        major: "ภาควิชาวิศวกรรมไฟฟ้า",
        title: "สาขาวิชาวิศวกรรมไฟฟ้า",
        title_en: "Doctor of Philosophy Program in Electrical Engineering",
        degree: "ปริญญาเอก",
        contact: "053 944157",
        img: "/images/ee-logo.png",
        plans: [
            {
                plan_code: "1.1",
                plan_name: "แผน 1.1",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "ปริญญานิพนธ์ 48 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 3 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 35,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 210,000 บาท",
                qualification: "สำเร็จการศึกษาระดับปริญญาโท สาขาวิชาวิศวกรรมไฟฟ้า หรือสาขาที่เกี่ยวข้องมีผลการเรียนดี มีค่าลำดับขั้นเฉลี่ยไม่ต่ำกว่า 3.25 จากระบบ 4.00หรือมีประสบการณ์ไม่น้อยกว่า 2 ปี ด้านการวิจัยหรือการประกอบวิชาชีพ สาขาวิชาวิศวกรรมไฟฟ้า หรือสาขาที่เกี่ยวข้องและมีพื้นความรู้และศักยภาพเพียงพอที่จะทำวิจัยได้"
            },
            {
                plan_code: "1.2",
                plan_name: "แผน 1.2",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "ปริญญานิพนธ์ 72 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 5 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 35,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 350,000 บาท",
                qualification: "สำเร็จการศึกษาระดับปริญญาตรี สาขาวิชาวิศวกรรมไฟฟ้ามีผลการเรียนดีเด่น ได้รับเกียรตินิยมหรือ มีประสบการณ์ไม่น้อยกว่า 3 ปี ด้านการวิจัยหรือการประกอบวิชาชีพ สาขาวิชาวิศวกรรมไฟฟ้า หรือสาขาที่เกี่ยวข้องและมีพื้นความรู้และศักยภาพเพียงพอที่จะทำวิจัยได้ หรือกำลังศึกษาอยู่ในหลักสูตรปริญญาโท สาขาวิชาวิศวกรรมไฟฟ้า หรือสาขาที่เกี่ยวข้องที่มีผลการเรียนและผลงานวิจัยเป็นที่ยอมรับ"
            }
        ]
    },



    industial_engineering_master: {
        major: "ภาควิชาวิศวกรรมอุตสาหการ",
        title: "สาขาวิชาวิศวกรรมอุตสาหการ",
        title_en: "Master of Engineering Program in Industrial Engineering",
        degree: "ปริญญาโท",
        contact: "053 944183",
        img: "/images/ie-logo.png",
        plans: [
            {
                plan_code: "1",
                plan_name: "แผน 1 แบบวิชาการ",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "ปริญญานิพนธ์ 36 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 25,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 100,000 บาท",
                qualification: "สำเร็จการศึกษาระดับปริญญาตรีสาขาวิชาวิศวกรรมศาสตร์หรือเทียบเท่า",
            },
            {
                plan_code: "2",
                plan_name: "แผน 2 แบบวิชาการ",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "เรียนคอร์สเวิร์ก 24 หน่วยกิต ปริญญานิพนธ์ 12 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 25,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 100,000 บาท",
                qualification: "สำเร็จการศึกษาระดับปริญญาตรีสาขาวิชาวิศวกรรมศาสตร์หรือเทียบเท่า",
            }
            ,
            {
                plan_code: "3",
                plan_name: "แผน 3 แบบวิชาชีพ",
                study_type: "ภาคพิเศษ (ส.-อา.)",
                credit: "เรียนคอร์สเวิร์ก 30 หน่วยกิต ปริญญานิพนธ์ 6 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "เสาร์–อาทิตย์",
                fee: "ภาคการศึกษาละ 42,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 168,000 บาท",
                qualification: "สำเร็จการศึกษาระดับปริญญาตรีสาขาวิชาวิศวกรรมศาสตร์หรือเทียบเท่า",
            }
        ]

    },
    industial_engineering_phd: {
        major: "ภาควิชาวิศวกรรมอุตสาหการ",
        title: "สาขาวิชาวิศวกรรมอุตสาหการ",
        title_en: "Doctor of Philosophy Program in Industrial Engineering",
        degree: "ปริญญาเอก",
        contact: "053 944183",
        img: "/images/ie-logo.png",
        plans: [
            {
                plan_code: "1.1",
                plan_name: "แผน 1.1",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "ปริญญานิพนธ์ 48 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 3 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 42,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 252,000 บาท",
                qualification: "สำเร็จการศึกษาระดับปริญญาโท สาขาวิชาวิศวกรรมอุตสาหการ วิศวกรรมการผลิต หรือสาขาใกล้เคียงวิศวกรรมอุตสาหการ ที่มีผลการเรียนระดับปริญญาโทไม่น้อยกว่า 3.5 และมีพื้นความรู้ความสามารถและศักยภาพเพียงพอที่จะทำดุษฎีนิพนธ์ได้ หรือ สำเร็จการศึกษาระดับปริญญาตรี สาขาวิชาวิศวกรรมอุตสาหการ หรือวิศวกรรมศาสตร์สาขาที่เกี่ยวข้อง เช่น วิศวกรรมการผลิต วิศวกรรมโลหะ วิศวกรรมอาหาร ฯลฯ ที่มีพื้นความรู้ความสามารถและศักยภาพเพียงพอที่จะทำดุษฎีนิพนธ์ได้ มีผลการเรียนระดับปริญญาตรีไม่น้อยกว่า 3.0 หรือผู้มีประสบการณ์การทำงานเกี่ยวกับสาขาวิชาวิศวกรรมอุตสาหการ หรือสาขาที่เกี่ยวข้องอย่างน้อย 10 ปี"
            },
            {
            plan_code: "2.1",
            plan_name: "แผน 2.1",
            study_type: "ภาคปกติ (จ.-ศ.)",
            credit: "เรียนคอร์สเวิร์ก 18 หน่วยกิต ปริญญานิพนธ์ 36 หน่วยกิต",
            duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 3 ปี",
            date_study: "จันทร์–ศุกร์",
            fee: "ภาคการศึกษาละ 42,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 252,000 บาท",
            qualification: "สำเร็จการศึกษาระดับสำเร็จการศึกษาระดับปริญญาตรี หรือปริญญาโท ในด้านวิศวกรรมศาสตร์ หรือวิทยาศาสตร์ อย่างน้อย 1 ปริญญา และ สำเร็จการศึกษาระดับปริญญาโท สาขาวิชาวิศวกรรมอุตสาหการ หรือสาขาที่เกี่ยวข้อง มีผลการเรียนระดับปริญญาโท ไม่น้อยกว่า 3.25 และมีพื้นความรู้ความสามารถและศักยภาพเพียงพอที่จะทำดุษฎีนิพนธ์ได้"
        }
            ]
    },
    logging_engineering_meng: {
        major :'ภาควิชาวิศวกรรมอุตสาหการ',
        title: "สาขาวิชาวิศวกรรมโลจิสติกส์และการจัดการโซ่อุปทาน",
        title_en: "Master of Engineering Program in Logistics and Supply Chain Engineering",
        degree: "ปริญญาโท",
        contact: "053 944183",
        img: "/images/ie-logo.png",
        plans: [
            {
                plan_code: "1",
                plan_name: "แผน 1 แบบวิชาการ",
                study_type: "ภาคปกติ (จ.-ศ.)",   
                credit: "ปริญญานิพนธ์ 36 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 42,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 168,000 บาท",
                qualification: "เป็นผู้ที่สำเร็จการศึกษาในระดับปริญญาตรีสาขาวิชาวิศวกรรมศาสตร์หรือเทียบเท่าที่คณะกรรมการบริหารหลักสูตรบัณฑิตศึกษาเห็นชอบ โดยมีผลการเรียนในระดับปริญญาตรีไม่ต่ำกว่า 3.00 หรือมีประสบการณ์การทำงานที่เกี่ยวข้องไม่น้อยกว่า 2 ปี",
            },
            {
                plan_code: "2",
                plan_name: "แผน 2 แบบวิชาการ",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "เรียนคอร์สเวิร์ก 24 หน่วยกิต ปริญญานิพนธ์ 12 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 42,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 168,000 บาท",
                qualification: "เป็นผู้ที่สำเร็จการศึกษาในระดับปริญญาตรีสาขาวิชาวิศวกรรมศาสตร์ วิทยาศาสตร์ อุตสาหกรรมเกษตร หรือสาขาวิชาที่เกี่ยวข้อง/สัมพันธ์กัน หรือเทียบเท่าที่คณะกรรมการบริหารหลักสูตรเห็นชอบ",
            },
             {
                plan_code: "2.2",
                plan_name: "แผน 2 แบบวิชาการ (ปริญญาคู่ 2 ใบปริญญา) ",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "เรียนคอร์สเวิร์ก 24 หน่วยกิต ปริญญานิพนธ์ 12 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 42,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 168,000 บาท",
                qualification: "เป็นผู้ที่สำเร็จการศึกษาในระดับปริญญาตรีสาขาวิชาวิศวกรรมศาสตร์ วิทยาศาสตร์ อุตสาหกรรมเกษตร หรือสาขาวิชาที่เกี่ยวข้อง/สัมพันธ์กัน หรือเทียบเท่าที่คณะกรรมการบริหารหลักสูตรเห็นชอบ",
            },
            {
                plan_code: "3",
                plan_name: "แผน 3 แบบวิชาชีพ",
                study_type: "ภาคพิเศษ (ส.-อา.)",
                credit: "เรียนคอร์สเวิร์ก 30 หน่วยกิต ปริญญานิพนธ์  6 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "เสาร์–อาทิตย์",
                fee: "ภาคการศึกษาละ 42,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 168,000 บาท",
                qualification: "เป็นผู้ที่สำเร็จการศึกษาในระดับปริญญาตรีสาขาวิชาวิศวกรรมศาสตร์ วิทยาศาสตร์ อุตสาหกรรมเกษตร หรือสาขาวิชาที่เกี่ยวข้อง/สัมพันธ์กัน หรือเทียบเท่าที่คณะกรรมการบริหารหลักสูตรเห็นชอบ",

            }
        ]
    },
    industial_management_master: {
        major: "ภาควิชาวิศวกรรมอุตสาหการ",
        title: "การจัดการอุตสาหกรรม",
        title_en: "Master of Science Program in Industrial Management",
        degree: "ปริญญาโท",
        contact: "053 944183",
        img: "/images/ie-logo.png",
        plans: [
            {
                plan_code: "1",
                plan_name: "แผน 1 แบบวิชาการ",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "ปริญญานิพนธ์ 36 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 31,500 บาท ค่าธรรมเนียมตลอดหลักสูตร 126,000 บาท",
                qualification: "สำเร็จการศึกษาระดับปริญญาตรีจากทุกสาขาผู้สมัครต้องมีประสบการณ์การทำงานในงานที่เกี่ยวข้องกับการบริหารงาน หรืองานด้านการจัดการ หรือ งานที่เกี่ยวข้องกับงานด้านอุตสาหกรรม มาไม่น้อยกว่า 5 ปี หรือมีประสบการณ์การทำงานในงานที่เกี่ยวข้องกับการจัดการด้านการบริการสุขภาพ มาไม่น้อยกว่า 2 ปี",
            },
            {
                plan_code: "3",
                plan_name: "แผน 3 แบบวิชาชีพ",
                study_type: "ภาคพิเศษ (ส.-อา.)",
                credit: "เรียนคอร์สเวิร์ก 30 หน่วยกิต ปริญญานิพนธ์  6 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "วันจันทร์ พุธ ศุกร์ เวลา 18.30-21.30 น. และวันอาทิตย์ เวลา 9.00-16.00 น.",
                fee: "ภาคการศึกษาละ 31,500 บาท ค่าธรรมเนียมตลอดหลักสูตร 126,000 บาท",
                qualification: "สำเร็จการศึกษาระดับปริญญาตรีจากทุกสาขาผู้สมัครต้องมีประสบการณ์การทำงานในงานที่เกี่ยวข้องกับการบริหารงาน หรืองานด้านการจัดการ หรืองานที่เกี่ยวข้องกับงานด้านอุตสาหกรรม มาไม่น้อยกว่า 1 ปี"
            },

        ]
    },
    me_master: {
        major: "ภาควิชาวิศวกรรมเครื่องกล",
        title: "สาขาวิชาวิศวกรรมเครื่องกล",
        title_en: "Master of Engineering Program in Mechanical Engineering",
        degree: "ปริญญาโท",
        contact: "053 944146",
        img: "/images/me-logo.png",
        plans: [
            {
                plan_code: "1",
                plan_name: "แผน 1 แบบวิชาการ",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "ปริญญานิพนธ์ 36 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 30,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 120,000 บาท",
                qualification: "สำเร็จการศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิตในสาขาวิชาวิศวกรรมเครื่องกล หรือสาขาที่เกี่ยวข้องที่มีพื้นฐานทางฟิสิกส์ และคณิตศาสตร์ที่ดีเป็นบุคลากรทางสายวิศวกรรมหรือเทียบเท่าที่ได้รับการคัดสรรจากองค์กรภาครัฐหรือเอกชนทั้งในและนอกประเทศที่มีข้อตกลงร่วมกับมหาวิทยาลัยเชียงใหม่ หรือ มีประสบการณ์ทางด้านวิศวกรรมเครื่องกลอย่างน้อย 2 ปี"
            },
            {
                plan_code: "2",
                plan_name: "แผน 2 แบบวิชาการ",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "เรียนคอร์สเวิร์ก 24 หน่วยกิต ปริญญานิพนธ์ 12 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 30,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 120,000 บาท",
                qualification: "สำเร็จการศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิตในสาขาวิชาวิศวกรรมเครื่องกล หรือสาขาที่เกี่ยวข้องที่มีพื้นฐานทางฟิสิกส์ และคณิตศาสตร์ที่ดี"
            },
            {
                plan_code: "3",
                plan_name: "แผน 3 แบบวิชาชีพ",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "เรียนคอร์สเวิร์ก 30 หน่วยกิต ปริญญานิพนธ์ 6 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 30,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 120,000 บาท",
                qualification: "สำเร็จการศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิตในสาขาวิชาวิศวกรรมเครื่องกล วิศวกรรมไฟฟ้า วิศวกรรมคอมพิวเตอร์ วิศวกรรมวัดคุม หรือสาขาที่เกี่ยวข้องที่มีพื้นฐานทางฟิสิกส์ และคณิตศาสตร์ที่ดี"
            }
        
            
        ]
    }
    ,
    me_phd: {
        major: "ภาควิชาวิศวกรรมเครื่องกล",
        title: "สาขาวิชาวิศวกรรมเครื่องกล",
        title_en: "Doctor of Philosophy Program in Mechanical Engineering",
        degree: "ปริญญาเอก",
        contact: "053 944146",
        img: "/images/me-logo.png",
        plans: [
            {
                plan_code: "1.1",
                plan_name: "แผน 1.1",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "ปริญญานิพนธ์ 48 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 3 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 35,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 210,000 บาท",
                qualification: "สำเร็จการศึกษาระดับปริญญาโทวิศวกรรมศาสตรมหาบัณฑิต ในหลักสูตรที่มีการลงทะเบียนวิชาเรียนในสาขาวิชาวิศวกรรมเครื่องกล หรือสาขาที่เกี่ยวข้องที่มีพื้นฐานทางฟิสิกส์ และคณิตศาสตร์ที่ดีเป็นบุคลากรทางสายวิศวกรรมหรือเทียบเท่าที่ได้รับการคัดสรรจากองค์กรภาครัฐหรือเอกชนทั้งในและนอกประเทศที่มีข้อตกลงร่วมกับมหาวิทยาลัยเชียงใหม่",
            },
            {
                plan_code: "2.1",
                plan_name: "แผน 2.1",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "เรียนคอร์สเวิร์ก 12 หน่วยกิต ปริญญานิพนธ์ 36 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 3 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 35,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 210,000 บาท",
                qualification: "สำเร็จการศึกษาระดับปริญญาโท วิศวกรรมศาสตรมหาบัณฑิต ในสาขาวิชาวิศวกรรมเครื่องกล หรือสาขาที่เกี่ยวข้องที่มีพื้นฐานทางฟิสิกส์ และคณิตศาสตร์ที่ดี และมีผลการศึกษาอยู่ในระดับดี เหมาะสำหรับผู้ต้องการทำวิจัยพร้อมทั้งเรียนรู้วิชาการต่างๆ ที่ครอบคลุมในสาขาความเชี่ยวชาญ",
            },
            {
                plan_code: "2.2",
                plan_name: "แผน 2.2",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "เรียนคอร์สเวิร์ก 24 หน่วยกิต ปริญญานิพนธ์ 24 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 5 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 33,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 330,000 บาท",
                qualification: "สำเร็จการศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิต ในสาขาวิชาวิศวกรรมเครื่องกล หรือสาขาที่เกี่ยวข้องที่มีพื้นฐานทางฟิสิกส์ และคณิตศาสตร์ที่ดี",
            }
        ]
    },
    enegy_master: {
        major: "ภาควิชาวิศวกรรมเครื่องกล",
        title: "สาขาวิชาวิศวกรรมพลังงาน",
        title_en: "Master of Engineering Program in Energy Engineering",
        degree: "ปริญญาโท",
        contact: "053 944146",
        img: "/images/me-logo.png",
        plans: [
            {
                plan_code: "1",
                plan_name: "แผน 1 แบบวิชาการ",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "ปริญญานิพนธ์ 36 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 35,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 140,000 บาท",
                qualification: "สำเร็จการศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิต ในสาขาวิชาวิศวกรรมเครื่องกล วิศวกรรมพลังงาน วิศวกรรมไฟฟ้า วิศวกรรมคอมพิวเตอร์ วิศวกรรมเคมี วิศวกรรมเหมืองแร่ วิศวกรรมเกษตร และวิศวกรรมอุตสาหการ หรือปริญญาตรีวิทยาศาสตรบัณฑิต ในสาขาวิชาเคมี ฟิสิกส์ วัสดุศาสตร์ เคมีอุตสาหกรรม อุตสาหกรรมเกษตร หรืออย่างน้อยปริญญาตรีในสาขาที่เกี่ยวข้อง และมีผลการศึกษาอยู่ในระดับดี (มีคะแนนสะสมเฉลี่ย (GPA) ไม่ต่ำกว่า 3.00) หรือมีผลงานตีพิมพ์เผยแพร่ หรือเป็นบุคลากรทางสายวิศวกรรมหรือเทียบเท่าที่ได้รับการคัดสรรจากองค์กรภาครัฐหรือเอกชนทั้งในและนอกประเทศที่มีข้อตกลงร่วมกับมหาวิทยาลัยเชียงใหม่ หรือ มีประสบการณ์ทางด้านวิศวกรรมพลังงานอย่างน้อย 2 ปี"
                
            }
            ,
            {
                plan_code :"2",
                plan_name: "แผน 2 แบบวิชาการ",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "เรียนคอร์สเวิร์ก 24 หน่วยกิต ปริญญานิพนธ์ 12 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 35,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 140,000 บาท",
                qualification:"สำเร็จการศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิตในสาขาวิชาวิศวกรรมเครื่องกล วิศวกรรมพลังงาน วิศวกรรมไฟฟ้า วิศวกรรมคอมพิวเตอร์ วิศวกรรมเคมี วิศวกรรมเหมืองแร่ วิศวกรรมเกษตร และวิศวกรรมอุตสาหการ หรือปริญญาตรีวิทยาศาสตรบัณฑิต ในสาขาวิชาเคมี ฟิสิกส์ วัสดุศาสตร์ เคมีอุตสาหกรรม อุตสาหกรรมเกษตรหรืออย่างน้อยปริญญาตรีในสาขาที่เกี่ยวข้อง"

            },
            {
                plan_code: "3",
                plan_name: "แผน 3 แบบวิชาชีพ",
                study_type: "ภาคพิเศษ(ส.-อา.)",
                credit: "เรียนคอร์สเวิร์ก 30 หน่วยกิต ปริญญานิพนธ์ 6 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "เสาร์–อาทิตย์",
                fee: "ภาคการศึกษาละ 50,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 200,000 บาท",
                qualification: "สำเร็จการศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิต ในสาขาวิชาวิศวกรรมเครื่องกล วิศวกรรมพลังงาน วิศวกรรมไฟฟ้า วิศวกรรมคอมพิวเตอร์ วิศวกรรมเคมี วิศวกรรมเหมืองแร่ วิศวกรรมเกษตร และวิศวกรรมอุตสาหการ หรือปริญญาตรีวิทยาศาสตรบัณฑิต ในสาขาวิชาเคมี ฟิสิกส์ วัสดุศาสตร์ เคมีอุตสาหกรรม อุตสาหกรรมเกษตร หรืออย่างน้อยปริญญาตรีในสาขาที่เกี่ยวข้อง"

            }
        ]
    }
    ,
    enegy_phd: {
        major: "ภาควิชาวิศวกรรมเครื่องกล",
        title: "สาขาวิชาวิศวกรรมพลังงาน",
        title_en: "Doctor of Philosophy Program in Energy Engineering",
        degree: "ปริญญาเอก",
        contact: "053 944146",
        img: "/images/me-logo.png",
        plans: [
            {
                plan_code: "1.1",
                plan_name: "แผน 1.1",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "ปริญญานิพนธ์ 48 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 3 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 35,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 210,000 บาท",
                qualification: "สำเร็จการศึกษาระดับปริญญาโทวิศวกรรมศาสตรมหาบัณฑิต ในสาขาวิชาวิศวกรรมเครื่องกล วิศวกรรมพลังงาน วิศวกรรมไฟฟ้า วิศวกรรมคอมพิวเตอร์ วิศวกรรมเคมี วิศวกรรมเหมืองแร่ วิศวกรรมเกษตร และวิศวกรรมอุตสาหการ หรือปริญญาโทวิทยาศาสตรมหาบัณฑิต ในสาขาวิชาเคมี ฟิสิกส์ วัสดุศาสตร์ เคมีอุตสาหกรรม อุตสาหกรรมเกษตร หรืออย่างน้อยปริญญาโทในสาขาที่เกี่ยวข้อง และมีผลการศึกษาอยู่ในระดับดีมาก หรือมีผลงานตีพิมพ์เผยแพร่ หรือเป็นบุคลากรทางสายวิศวกรรมหรือเทียบเท่าที่ได้รับการคัดสรรจากองค์กรภาครัฐหรือเอกชนทั้งในและนอกประเทศที่มีข้อตกลงร่วมกับมหาวิทยาลัยเชียงใหม่ หรือ มีประสบการณ์ทางด้านวิศวกรรมพลังงานอย่างน้อย 2 ปี"
            },
            {
                plan_code: "2.1",
                plan_name: "แผน 2.1",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "เรียนคอร์สเวิร์ก 12 หน่วยกิต ปริญญานิพนธ์ 36 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 3 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 35,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 210,000 บาท",
                qualification: "สำเร็จการศึกษาระดับปริญญาโทวิศวกรรมศาสตรมหาบัณฑิต ในสาขาวิชาวิศวกรรมเครื่องกล วิศวกรรมพลังงาน วิศวกรรมไฟฟ้า วิศวกรรมคอมพิวเตอร์ วิศวกรรมเคมี วิศวกรรมเหมืองแร่ วิศวกรรมเกษตร และวิศวกรรมอุตสาหการ หรือปริญญาโทวิทยาศาสตรมหาบัณฑิต ในสาขาวิชาเคมี ฟิสิกส์ วัสดุศาสตร์ เคมีอุตสาหกรรม อุตสาหกรรมเกษตร หรืออย่างน้อยปริญญาโทในสาขาที่เกี่ยวข้อง และมีผลการศึกษาอยู่ในระดับดี หรือมีผลงานตีพิมพ์เผยแพร่หรือเป็นบุคลากรทางสายวิศวกรรมหรือเทียบเท่าที่ได้รับการคัดสรรจากองค์กรภาครัฐหรือเอกชนทั้งในและนอกประเทศที่มีข้อตกลงร่วมกับมหาวิทยาลัยเชียงใหม่ หรือ มีประสบการณ์ทางด้านวิศวกรรมพลังงานอย่างน้อย 1 ปี"
            },
            {
                plan_code: "2.2",
                plan_name: "แผน 2.2",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "เรียนคอร์สเวิร์ก 24 หน่วยกิต ปริญญานิพนธ์ 48 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 5 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 33,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 330,000 บาท",
                qualification: "สำเร็จการศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิต ในสาขาวิชาวิศวกรรมเครื่องกล วิศวกรรมพลังงาน วิศวกรรมไฟฟ้า วิศวกรรมคอมพิวเตอร์ วิศวกรรมเคมี วิศวกรรมเหมืองแร่ วิศวกรรมเกษตร และวิศวกรรมอุตสาหการ หรือปริญญาตรีวิทยาศาสตรบัณฑิต ในสาขาวิชาเคมี ฟิสิกส์ วัสดุศาสตร์ เคมีอุตสาหกรรม อุตสาหกรรมเกษตร หรืออย่างน้อยปริญญาตรีในสาขาที่เกี่ยวข้อง มีผลการศึกษาอยู่ในระดับเกียรตินิยมหรือค่าลำดับขั้นสะสมเฉลี่ยตลอดหลักสูตรตั้งแต่ 3.50 ขึ้นไป หรือมีผลงานตีพิมพ์เผยแพร่ หรือเป็นบุคลากรทางสายวิศวกรรมหรือเทียบเท่าที่ได้รับการคัดสรรจากองค์กรภาครัฐหรือเอกชนทั้งในและนอกประเทศที่มีข้อตกลงร่วมกับมหาวิทยาลัยเชียงใหม่ หรือ มีประสบการณ์ทางด้านวิศวกรรมพลังงานอย่างน้อย 4 ปี"
            }
        

        ]
    }
    // วิศวเกษตร
    ,    agricultural_engineering_meng: {
        major: "ภาควิชาวิศวกรรมเครื่องกล",
        title: "สาขาวิชาวิศวกรรมเกษตร",
        title_en: "Master of Engineering Program in Agricultural Engineering",
        degree: "ปริญญาโท",
        contact: "053 944146",
        img: "/images/me-logo.png",
        plans: [
            {
                plan_code: "1", 
                plan_name: "แผน 1 แบบวิชาการ",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "ปริญญานิพนธ์ 36 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 25,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 100,000 บาท",
                qualification: "ต้องสำเร็จการศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิต ในสาขาวิชาวิศวกรรมเกษตรหรือเทียบเท่าและเป็นผู้ที่ได้รับปริญญาเกียรตินิยม หรือต้องสำเร็จการศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิต หรืออย่างน้อยปริญญาตรีในสาขาวิชาที่เกี่ยวข้อง และมีประสบการณ์ทำงานวิชาชีพสาขาวิชาวิศวกรรมเกษตรหรือสาขาวิชาที่เกี่ยวข้องมาแล้วไม่น้อยกว่า 3 ปี",
            },
            {
                plan_code: "2",
                plan_name: "แผน 2 แบบวิชาการ",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "เรียนคอร์สเวิร์ก 24 หน่วยกิต ปริญญานิพนธ์ 12 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 25,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 100,000 บาท",
                qualification: "ต้องสำเร็จการศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิต ในสาขาวิชาวิศวกรรมเกษตรหรือเทียบเท่าหรือ ต้องสำเร็จการศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิตสาขาวิชาอื่น หรือวิทยาศาสตรบัณฑิต",
            }
        ]
    },
    // วิศวกรรมเชิงคำนวณขั้นสูงและการออกแบบ 
    advanced_computational_engineering_master: {
        major: "ภาควิชาวิศวกรรมเครื่องกล",
        title: "สาขาวิชาวิศวกรรมเชิงคำนวณขั้นสูงและการออกแบบ",
        title_en: "Master of Engineering Program in Advanced Computational Engineering and Design",
        degree: "ปริญญาโท",
        contact: "053 944146",
        img: "/images/me-logo.png",
        plans: [
            {
                plan_code: "1",
                plan_name: "แผน 1 แบบวิชาการ",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "ปริญญานิพนธ์ 36 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 42,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 168,000 บาท",
                qualification: "สำเร็จการศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิต หรือปริญญาตรีวิทยาศาสตรบัณฑิตหรืออย่างน้อยปริญญาตรีในสาขาที่เกี่ยวข้อง มีผลการศึกษาอยู่ในระดับดี (มีคะแนนสะสมเฉลี่ย (GPA) ไม่ต่ำกว่า 3.00) หรือมีผลงานตีพิมพ์เผยแพร่หรือเป็นบุคลากรทางสายวิศวกรรมหรือเทียบเท่าที่ได้รับการคัดสรรจากองค์กรภาครัฐหรือเอกชนทั้งในและนอกประเทศที่มีข้อตกลงร่วมกับมหาวิทยาลัยเชียงใหม่ หรือมีประสบการณ์ทางด้านวิศวกรรมเชิงคำนวณอย่างน้อย 3 ปี",
            },
            {
                plan_code: "3",
                plan_name: "แผน 3 แบบวิชาชีพ",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "เรียนคอร์สเวิร์ก 31 หน่วยกิต ค้นคว้าอิสระ 6 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "เสาร์–อาทิตย์",
                fee: "ภาคการศึกษาละ 42,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 168,000 บาท",
                qualification: "สำเร็จการศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิต หรือปริญญาตรีวิทยาศาสตรบัณฑิต หรืออย่างน้อยปริญญาตรีในสาขาที่เกี่ยวข้อง"
            }

        ]
    

    },


// วิศวกรรมคอมพิวเตอร์ (ปริญญาโท)
    computer_engineering_meng: {
        major: "ภาควิชาวิศวกรรมคอมพิวเตอร์",
        title: "สาขาวิชาวิศวกรรมคอมพิวเตอร์",
        title_en: "Master of Engineering Program in Computer Engineering",
        degree: "ปริญญาโท",
        contact: "0-5394-2023",
        img: "/images/ce-logo.png",
        plans: [
            {
                plan_code: "1",
                plan_name: "แผน 1 แบบวิชาการ",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "ปริญญานิพนธ์ 36 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 25,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 100,000 บาท",
                qualification: "ผู้สมัครต้องเป็นผู้ที่มีวุฒิการศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิตในสาขาวิศวกรรมคอมพิวเตอร์ หรือผู้สมัครต้องเป็นผู้ที่มีวุฒิการศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิตเกียรตินิยมในสาขาวิศวกรรมคอมพิวเตอร์ หรือ เทียบเท่าที่คณะกรรมการบริหารหลักสูตรเห็นชอบ หรือมีประสบการณ์ในการทำงานวิชาชีพสาขาวิศวกรรมคอมพิวเตอร์มาแล้วไม่น้อยกว่า 2 ปี"
            },
            {
                plan_code: "2",
                plan_name: "แผน 2 แบบวิชาการ",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "เรียนคอร์สเวิร์ก 24 หน่วยกิต ปริญญานิพนธ์ 12 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 25,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 100,000 บาท",
                qualification: "ผู้สมัครต้องเป็นผู้ที่มีวุฒิการศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิตในสาขาวิศวกรรมคอมพิวเตอร์ หรือผู้สมัครต้องเป็นผู้ที่มีวุฒิการศึกษาระดับปริญญาตรีวิทยาศาสตรบัณฑิตสาขาวิทยาการคอมพิวเตอร์ หรือผู้สมัครต้องเป็นผู้ที่มีวุฒิการศึกษาระดับปริญญาตรีในสาขาวิชาที่เกี่ยวข้องตามที่คณะกรรมการบริหารหลักสูตรเห็นชอบ"
            },
            {
            plan_code: "3",
            plan_name: "แผน 3 แบบวิชาชีพ",
            study_type: "ภาคพิเศษ (ส.-อา.)",
            credit: "เรียนคอร์สเวิร์ก 30 หน่วยกิต ค้นคว้าอิสระ 6 หน่วยกิต",
            duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
            date_study: "เสาร์–อาทิตย์",
            fee: "ภาคการศึกษาละ 38,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 152,000 บาท",
            qualification: "ผู้สมัครต้องเป็นผู้ที่มีวุฒิการศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิตในสาขาวิศวกรรมคอมพิวเตอร์ หรือผู้สมัครต้องเป็นผู้ที่มีวุฒิการศึกษาระดับปริญญาตรีวิทยาศาสตรบัณฑิตสาขาวิทยาการคอมพิวเตอร์ หรือผู้สมัครต้องเป็นผู้ที่มีวุฒิการศึกษาระดับปริญญาตรีในสาขาวิชาที่เกี่ยวข้องตามที่คณะกรรมการบริหารหลักสูตรเห็นชอบ"
            }
        ]
    }
    // วิศวกรรมเทคโนโลยีพลาสมาและระบบกลไฟฟ้าจุลภาค (ปริญญาโท)
    ,plasma_microelectromechanical_systems_engineering_meng: {
        major: "ศูนย์การศึกษาสหวิทยาการสาขา",
        title: "สาขาวิชาวิศวกรรมเทคโนโลยีพลาสมาและระบบกลไฟฟ้าจุลภาค",
        title_en: "Master of Engineering Program in Plasma Technology and Microelectromechanical Systems Engineering",
        degree: "ปริญญาโท",
        contact: "-",
        img: "/images/interdis-logo.png",
        plans: [
            {
                plan_code: "1",
                plan_name: "แผน 1 แบบวิชาการ",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "ปริญญานิพนธ์ 36 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 35,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 140,000 บาท",
                qualification: "สำเร็จการศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิต หรือวิทยาศาสตรบัณฑิต และมีประสบการณ์ทำงานเกี่ยวข้องกับสาขาวิชาวิศวกรรมเทคโนโลยีพลาสมาและระบบกลไฟฟ้าจุลภาค หรือสาขาที่เกี่ยวข้อง มาแล้วไม่น้อยกว่า 1 ปี หรือสำเร็จศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิตหรือ วิทยาศาสตรบัณฑิต โดยมีผลการเรียนระดับปริญญาตรีไม่น้อยกว่า 3.0 หรือ ได้รับเกียรตินิยมอันดับ 2 เป็นอย่างน้อย",
            },
            {
                plan_code: "2",
                plan_name: "แผน 2 แบบวิชาการ",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "เรียนคอร์สเวิร์ก 21 หน่วยกิต ปริญญานิพนธ์ 15 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 35,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 140,000 บาท",
                qualification: "สำเร็จการศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิต หรือวิทยาศาสตรบัณฑิตสำเร็จศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิต หรือ วิทยาศาสตรบัณฑิต โดยมีผลการเรียนระดับปริญญาตรีไม่น้อยกว่า 2.0"
            }
        ]
            }

        // วิศวกรรมเทคโนโลยีพลาสมาและระบบกลไฟฟ้าจุลภาค (ปริญญาเอก)
    ,plasma_microelectromechanical_systems_engineering_phd: {
        major: "ศูนย์การศึกษาสหวิทยาการสาขา",
        title: "สาขาวิชาวิศวกรรมเทคโนโลยีพลาสมาและระบบกลไฟฟ้าจุลภาค",
        title_en: "Doctor of Philosophy Program in Plasma Technology and Microelectromechanical Systems Engineering",
        degree: "ปริญญาเอก",
        contact: "-",
        img: "/images/interdis-logo.png",
        plans: [
            {
                plan_code: "1.1",
                plan_name: "แผน 1.1",
                study_type: "ภาคปกติ (จ.-ศ.)",
                credit: "ปริญญานิพนธ์ 48 หน่วยกิต",
                duration: "ระยะเวลาการศึกษาตลอดหลักสูตร 3 ปี",
                date_study: "จันทร์–ศุกร์",
                fee: "ภาคการศึกษาละ 50,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 300,000 บาท",
                qualification: "สำเร็จการศึกษาระดับปริญญาโทวิศวกรรมศาสตรมหาบัณฑิต หรือวิทยาศาสตรมหาบัณฑิต และมีประสบการณ์ทำงานเกี่ยวข้องกับสาขาวิชาวิศวกรรมเทคโนโลยีพลาสมาและระบบกลไฟฟ้าจุลภาค หรือสาขาที่เกี่ยวข้อง มาแล้วไม่น้อยกว่า 1 ปี หรือผ่านเกณฑ์เงื่อนไขภาษาต่างประเทศตามประกาศมหาวิทยาลัย",
            
            }
        ]



    }
    // วิศวกรรมสิ่งแวดล้อม (ปริญญาโท)
    ,env_ms:{
        major:"ภาควิชาวิศวกรรมสิ่งแวดล้อม",
        title:"สาขาวิชาวิศวกรรมสิ่งแวดล้อม",
        title_en:"Master of Science Program in Environmental Engineering",
        degree:"ปริญญาโท",
        contact:"053 944192",
        img:"/images/env-logo.png",
        plans:[
            {
                plan_code:"1",
                plan_name:"แผน 1 แบบวิชาการ",
                study_type:"ภาคปกติ (จ.-ศ.)",
                credit:"ปริญญานิพนธ์ 36 หน่วยกิต",
                duration:"ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study:"จันทร์–ศุกร์",
                fee:"ภาคการศึกษาละ 25,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 100,000 บาท",
                qualification: ["กรณีจบปริญญาตรีสาขาวิศวกรรมสิ่งแวดล้อม สำเร็จการศึกษาปริญญาตรีวิศวกรรมศาสตรบัณฑิต สาขาวิศวกรรมสิ่งแวดล้อม มีผลการเรียนดีเด่น (เกียรตินิยม) หรือ มีประสบการณ์ด้านการวิจัย/วิชาชีพที่เกี่ยวข้องอย่างน้อย 2 ปีมีหัวข้อวิจัย และได้รับการรับรองอาจารย์ที่ปรึกษาระดับบัณฑิตศึกษาจากภาควิชาวิศวกรรมสิ่งแวดล้อม",

"กรณีไม่ได้จบปริญญาตรีสาขาวิศวกรรมสิ่งแวดล้อม สำเร็จการศึกษาปริญญาตรีวิศวกรรมศาสตรบัณฑิต หรือวิทยาศาสตรบัณฑิต ทุกสาขามีประสบการณ์ด้านการวิจัย/วิชาชีพที่เกี่ยวข้องอย่างน้อย 5 ปีได้รับการรับรองอาจารย์ที่ปรึกษาระดับบัณฑิตศึกษาจากภาควิชาวิศวกรรมสิ่งแวดล้อม"
                ]
            },
            {
                plan_code:"2",
                plan_name:"แผน 2 แบบวิชาการ",
                study_type:"ภาคปกติ (จ.-ศ.)",
                credit:"เรียนคอร์สเวิร์ก 24 หน่วยกิต ปริญญานิพนธ์ 12 หน่วยกิต",
                duration:"ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study:"จันทร์–ศุกร์",
                fee:"ภาคการศึกษาละ 25,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 100,000 บาท",
                qualification: "สำเร็จการศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิตทุกสาขา หรือปริญญาตรีวิทยาศาสตรบัณฑิตทุกสาขา"
            },
            {
                plan_code:"3",
                plan_name:"แผน 3 แบบวิชาชีพ",
                study_type:"ภาคพิเศษ (ส.-อา.)",
                credit:"เรียนคอร์สเวิร์ก 30 หน่วยกิต ค้นคว้าอิสระ 6 หน่วยกิต",
                duration:"ระยะเวลาการศึกษาตลอดหลักสูตร 2 ปี",
                date_study:"เสาร์–อาทิตย์",    
                fee:"ภาคการศึกษาละ 40,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 160,000 บาท",
                qualification: "สำเร็จการศึกษาระดับปริญญาตรีวิศวกรรมศาสตรบัณฑิตทุกสาขา หรือปริญญาตรีวิทยาศาสตรบัณฑิตทุกสาขา"
            }

        ]
    },
    // วิศวกรรมสิ่งแวดล้อม (ปริญญาเอก)

env_phd:{
        major:"ภาควิชาวิศวกรรมสิ่งแวดล้อม",
        title:"สาขาวิชาวิศวกรรมสิ่งแวดล้อม",
        title_en:"Doctor of Philosophy Program in Environmental Engineering",
        degree:"ปริญญาเอก",
        contact:"053 944192",
        img:"/images/env-logo.png",
        plans:[
            {
                plan_code:"1.1",
                plan_name:"แผน 1.1",
                study_type:"ภาคปกติ (จ.-ศ.)",
                credit:"ปริญญานิพนธ์ 48 หน่วยกิต",
                duration:"ระยะเวลาการศึกษาตลอดหลักสูตร 3 ปี",
                date_study:"จันทร์–ศุกร์",
                fee:"ภาคการศึกษาละ 30,000 บาท ค่าธรรมเนียมตลอดหลักสูตร 180,000 บาท",
                qualification: "สำเร็จการศึกษาระดับปริญญาโท ทางด้านวิทยาศาสตร์ หรือ วิศวกรรมศาสตร์ในสาขาที่เกี่ยวข้องกับสิ่งแวดล้อม โดยมีเกรดเฉลี่ยไม่น้อยกว่า 3.25 หรือในกรณีที่มีเกรดเฉลี่ยน้อยกว่า 3.25 จะต้องเป็นผู้มีประสบการณ์ในวิชาชีพวิศวกรรมหรือวิทยาศาสตร์ที่เกี่ยวข้องกับสิ่งแวดล้อมมาแล้วไม่น้อยกว่า 2 ปี หรือมีผลงานทางวิชาการตีพิมพ์ในวารสารวิชาการระดับนานาชาติ และผ่านการพิจารณาจากคณะกรรมการบริหารหลักสูตรบัณฑิตศึกษา สาขาวิชาวิศวกรรมสิ่งแวดล้อมต้องสอบผ่านภาษาอังกฤษตามประกาศของมหาวิทยาลัยเชียงใหม่ เป็นผู้มีสัญชาติไทยหรือสัญชาติอื่น ที่สามารถศึกษาในหลักสูตรนี้ได้ต้องมีอาจารย์ที่ปรึกษาวิทยานิพนธ์หลักและแนวทางในการทำวิทยานิพนธ์ปริญญาเอกในกรณีที่นักศึกษามีความรู้พื้นฐานทางด้านวิศวกรรมสิ่งแวดล้อมไม่เพียงพอ นักศึกษาจะต้องลงเรียนวิชาในระดับบัณฑิตศึกษาสาขาวิศวกรรมสิ่งแวดล้อม ตามที่คณะกรรมการบริหารหลักสูตรบัณฑิตศึกษาหรืออาจารย์ที่ปรึกษาวิทยานิพนธ์กำหนดส่วนคุณสมบัติอื่นๆ ให้อยู่ในดุลยพินิจของคณะกรรมการบริหารหลักสูตรบัณฑิตศึกษาประจำสาขาวิชาวิศวกรรมสิ่งแวดล้อม"
            }
        ]

    }




    



};
